In [1]:
import pandas as pd
# Create the data
data={
    'Name':['Alice','Bob','Charlie'],
    'Score':[85, 90,78]
}
#Create a DataFrame (a table)
df=pd.DataFrame(data)
#Show the data
print(df)

      Name  Score
0    Alice     85
1      Bob     90
2  Charlie     78

In [2]:
df.columns
df['Score'].mean()
df[df['Score']>80]

    Name  Score
0  Alice     85
1    Bob     90

In [3]:
df['Grade']=['B','A','C']
df.head()

      Name  Score Grade
0    Alice     85     B
1      Bob     90     A
2  Charlie     78     C

In [3]:
import pandas as pd
data={
    'Name':['Alice','Bob','Charlie'],
    'Age':[23, 25, 22],
    'Score':[85, 90,78]
}
students = pd.DataFrame(data)
print(students)

      Name  Age  Score
0    Alice   23     85
1      Bob   25     90
2  Charlie   22     78

In [4]:
import pandas as pd
dataset = pd.read_excel("Car Inventory.xlsx")

In [5]:
dataset

    Unnamed: 0       Make      Model   Color  Mileage  Price  Cost
0          NaN      Honda     Accord     Red    63512   4000  3000
1          NaN      Honda     Accord    Blue    95135   2500  2000
2          NaN      Honda     Accord  Silver   101354   2000  1500
3          NaN     Toyota      Camry   Black    75006   2198  1900
4          NaN     Nissan     Altima   Green    69847   3826  3000
5          NaN     Nissan     Altima   Green    55233   2970  2500
6          NaN     Toyota    Corolla   Black    87278   2224  2100
7          NaN     Toyota    Corolla    Blue   130684   2798  2200
8          NaN     Toyota    Corolla  Silver    59169   2160  2000
9          NaN      Honda      Civic   White   138789   2723  1900
10         NaN       Ford      F-150   Black    89073   3950  3000
11         NaN  Chevrolet  Silverado   Green   109231   4959  4500
12         NaN  Chevrolet     Impala  Silver    87675   3791  3500
13         NaN  Chevrolet     Impala   White   140811   2340  2000
14         NaN  Chevrolet     Malibu   White   139300   3361  3000
15         NaN       Ford     Escape   Black    63259   3196  3050
16         NaN       Ford     Escape     Red    40826   4397  3900
17         NaN       Ford    Mustang  Silver    41560   3706  3100
18         NaN      Honda        CRV    Blue    49326   4745  4100
19         NaN     Nissan     Maxima     Red   101856   2914  2500
20         NaN       Ford     Fusion   Black    42542   2659  2100
21         NaN      Dodge    Charger  Silver    34853   4349  3500
22         NaN      Dodge    Charger  Silver    58173   4252  4000
23         NaN      Dodge    Charger   Black   136775   2090  1800

In [17]:
#3 MAIN PHASES OF DATA MANIPULATION:

#1.  DATA PREPARATION
#This is the first step where you load your raw data and get it ready.
 #Loading Data
#Imagine you downloaded a excel file from an online shop showing customer orders.

import pandas as pd
# Load a Excel file into a DataFrame
df = pd.read_excel("Car Inventory.xlsx") #This file must be in your folder
# View first few rows
print(df.head())
#pd.read_excel() is the read function to load excel files.

   Unnamed: 0    Make   Model   Color  Mileage  Price  Cost
0         NaN   Honda  Accord     Red    63512   4000  3000
1         NaN   Honda  Accord    Blue    95135   2500  2000
2         NaN   Honda  Accord  Silver   101354   2000  1500
3         NaN  Toyota   Camry   Black    75006   2198  1900
4         NaN  Nissan  Altima   Green    69847   3826  3000

In [16]:
students = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Age': [20, 21, 22]
})

scores = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Score': [85, 90, 78]
})

merged = pd.merge(students, scores, on='Student')

print(merged)

   Student  Age  Score
0    Alice   20     85
1      Bob   21     90
2  Charlie   22     78

In [18]:
#Concatenating Data
#If you have two data tables with the same structure, and you want to stack them together, use concat().
data1 = pd.DataFrame({'Name': ['John', 'Mary'], 'Age': [25, 27]})
data2 = pd.DataFrame({'Name': ['James', 'Rita'], 'Age': [28, 30]})

combined = pd.concat([data1, data2])

print(combined)

    Name  Age
0   John   25
1   Mary   27
0  James   28
1   Rita   30

In [19]:
#DATA TRANSFORMATION IN PANDAS
#What is it?
#It means changing, cleaning, or adjusting your data so it’s in the right shape to analyze.
#Think of it like ironing and folding your clothes after washing — you’re making everything neat and useful.

#Real-Life Example:
#Imagine you’re working with a customer list that:
#•Has duplicate entries (same name, email, etc.)
#•Some emails are written in all caps
#•You want to extract first names from full names
#Let’s fix these!
#1. Removing Duplicates
#Sometimes the same data gets entered more than once.
import pandas as pd
# Sample data with duplicates
data = {
    'Name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob'],
    'Email': ['alice@example.com', 'bob@example.com', 'alice@example.com', 'charlie@example.com', 'bob@example.com']
}

df = pd.DataFrame(data)

print("Before Removing Duplicates:")
print(df)

Before Removing Duplicates:
      Name                Email
0    Alice    alice@example.com
1      Bob      bob@example.com
2    Alice    alice@example.com
3  Charlie  charlie@example.com
4      Bob      bob@example.com

In [20]:
# Remove duplicate rows
df_unique = df.drop_duplicates()

print("After Removing Duplicates:")
print(df_unique)
#2. String Manipulation
#Let’s say you have full names in one column and want to:
#•Extract first names
#•Convert all names to title case (e.g. “john” → “John”)
data = {
    'FullName': ['john doe', 'MARY ANN', 'alice Smith']
}

df = pd.DataFrame(data)

After Removing Duplicates:
      Name                Email
0    Alice    alice@example.com
1      Bob      bob@example.com
3  Charlie  charlie@example.com

In [21]:
# Convert to title case
df['FullName'] = df['FullName'].str.title()

# Split full name into first and last
df['FirstName'] = df['FullName'].str.split().str[0]
df['LastName'] = df['FullName'].str.split().str[1]

print(df)

      FullName FirstName LastName
0     John Doe      John      Doe
1     Mary Ann      Mary      Ann
2  Alice Smith     Alice    Smith

In [1]:
#DATA AGGREGATION IN PANDAS 
#What is Data Aggregation?
#Think of data aggregation like organizing your income and expenses by category. Instead of looking at every single item, you group them (e.g. food, transport, rent) and then summarize each category (e.g. total, average, highest, lowest).
#In Pandas, aggregation is done using tools like:
#•groupby() – for grouping
#•Aggregate functions – sum(), mean(), max(), min(), etc.

#Scenario:
#You’re a store owner with a sales record. You want to kno
#Scenario:
#You’re a store owner with a sales record. You want to know:
#•Total sales by product
#•Average quantity by salesperson

import pandas as pd

data = {
    'Product': ['Rice', 'Beans', 'Rice', 'Garri', 'Beans', 'Garri'],
    'Salesperson': ['John', 'Mary', 'John', 'Mary', 'John', 'Mary'],
    'Quantity': [10, 5, 8, 7, 6, 9],
    'Amount': [5000, 2500, 4000, 3500, 3000, 4500]
}

df = pd.DataFrame(data)
print(df)

  Product Salesperson  Quantity  Amount
0    Rice        John        10    5000
1   Beans        Mary         5    2500
2    Rice        John         8    4000
3   Garri        Mary         7    3500
4   Beans        John         6    3000
5   Garri        Mary         9    4500

In [2]:
#1. Using groupby() with sum()
#Total sales by product:
grouped_by_product = df.groupby('Product')['Amount'].sum()
print(grouped_by_product)

#What this means:
#•Beans sold for a total of ₦5500
#•Garri sold for ₦8000
#•Rice sold for ₦9000

Product
Beans    5500
Garri    8000
Rice     9000
Name: Amount, dtype: int64

In [3]:
#2. Using groupby() with mean()
#Average quantity by salesperson:
grouped_by_salesperson = df.groupby('Salesperson')['Quantity'].mean()
print(grouped_by_salesperson)

Salesperson
John    8.0
Mary    7.0
Name: Quantity, dtype: float64

In [4]:
#3. Using agg() to combine multiple summaries
#Total and Average Amount by Product:
summary = df.groupby('Product')['Amount'].agg(['sum', 'mean', 'max', 'min'])
print(summary)

#This tells us:
#•The total, average, maximum, and minimum sales per product.

          sum    mean   max   min
Product
Beans    5500  2750.0  3000  2500
Garri    8000  4000.0  4500  3500
Rice     9000  4500.0  5000  4000